
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3813095878)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-089be32b53ed93a44]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04569be9cc5bcc498]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0987943897935233f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0667441fb811d1d62]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a0c6669630006012]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-012beb5fcb619b0c2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c1dce4975135cf8b]
aws_security_group.alb: Refreshing state... [id=sg-063dfdb42dc033bce]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-034d6d26fe71ea68f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a4fcc6d5cb800c01]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08f97f54831d3942d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096a25608f5b80071]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-073b879e0fec67ce4]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ecb9a2a63a31e7e9]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-034d6d26fe71ea68f1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e1193eb6f82459ec]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a74d238845291c01]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d135d080dd37e251]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-091d85cb66945c032]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c1dce4975135cf8b1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-012beb5fcb619b0c21080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "go-simple-server-alb"
      + preserve_host_header       = false
      + security_groups            = [
          + "sg-063dfdb42dc033bce",
        ]
      + subnets                    = [
          + "subnet-0667441fb811d1d62",
          + "subnet-096a25608f5b80071",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0987943897935233f"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/8afa1aa532757fb2]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Still creating... [3m0s elapsed]
aws_lb.alb: Still creating... [3m10s elapsed]
aws_lb.alb: Creation complete after 3m15s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/go-simple-server-alb/1e1884b0df6efa30]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener-rule/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18/5a85275c312eb69a]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"5bc914286784fcb1a2419ca184afc5784e227738","Vars":{},"WorkflowName":"Terraform"} -->